app/views/squares/landing.html.erb

SELECT "characters".* FROM "characters" WHERE "characters"."world_id" = ? LIMIT ?  [["world_id", 1], ["LIMIT", 1]]
---
        <% end %>
        <% @world.characters.each do |character| %>

SELECT "squares".* FROM "squares" WHERE "squares"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
    function setupPayShardButton(button) {
      $(button).on('click', function() {
        console.log('Pay shard button clicked');
        const squareId = $(this).data('square-id');
        const square = document.querySelector(`[data-square-id="${squareId}"]`);
        const x = parseInt(square.getAttribute('data-x'));
        const y = parseInt(square.getAttribute('data-y'));

        // Add loading message to modal
        const modalContent = $('#popup-modal .modal-content');
        const originalContent = modalContent.html();
        modalContent.html(`
          <h3>Generating terrain<span class="dots">...</span></h3>
          <div class="loading-spinner"></div>
        `);

        const dotsInterval = setInterval(() => {
          const dots = modalContent.find('.dots');
          const currentDots = dots.text();
          dots.text(currentDots.length >= 3 ? '' : currentDots + '.');
        }, 500);
