app/views/worlds/index.html.erb

        <% @user_worlds.each do |user_world| %>
          <% world = World.find_by(id: user_world.world_id) %>
---
SELECT "user_worlds".* FROM "user_worlds" WHERE "user_worlds"."user_id" = ?  [["user_id", 1]]
SELECT "worlds".* FROM "worlds" WHERE "worlds"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]