app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."session_token" = ? LIMIT ?  [["session_token", "Au5rAptjL_Q7ojuLpXRrFQ"], ["LIMIT", 1]]
---
  def set_current_user
    @current_user ||= User.find_by_session_token(session[:session_token])