app/controllers/characters_controller.rb

SELECT "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
UPDATE "characters" SET "x_coord" = ?, "y_coord" = ? WHERE "characters"."id" = ?  [["x_coord", 230], ["y_coord", 74], ["id", 12]]
---
  def save_coordinates
    @character = Character.find(params[:id])

    if @character.update(x_coord: params[:x], y_coord: params[:y])