app/controllers/matching_game_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
SELECT "worlds".* FROM "worlds" WHERE "worlds"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
---
  def index
    @user = User.find_by(id: params[:user_id])
    return redirect_to root_path, alert: 'Invalid user' unless @user

    @world = World.find_by(id: params[:world_id])