app/controllers/settings_controller.rb

  def show
    @user ||= User.find_by id: params[:user_id] || User.find_by(id: session[:user_id])
    @world ||= World.find_by id: params[:world_id] || World.find_by(id: session[:world_id])
    @character ||= Character.find_by(user_id: @user.id, world_id: @world.id) || Character.find_by(character_id: session[:character_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "worlds".* FROM "worlds" WHERE "worlds"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
SELECT "user_worlds".* FROM "user_worlds" WHERE "user_worlds"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
SELECT "characters".* FROM "characters" WHERE "characters"."character_id" IS NULL LIMIT ?  [["LIMIT", 1]]
SELECT "user_worlds".* FROM "user_worlds" WHERE "user_worlds"."user_id" = ? AND "user_worlds"."world_id" IS NULL LIMIT ?  [["user_id", 4], ["LIMIT", 1]]

  def update
    if @current_user.update(default_currency: params[:currency])
---
UPDATE "users" SET "session_token" = ? WHERE "users"."id" = ?  [["session_token", "xxb1ZutTP8Auomop3qy1wA"], ["id", 4]]