app/controllers/squares_controller.rb

  def landing
    @squares = Square.all
---
SELECT "squares".* FROM "squares"