app/controllers/squares_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "worlds".* FROM "worlds" WHERE "worlds"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "characters".* FROM "characters" WHERE "characters"."world_id" = ? LIMIT ?  [["world_id", 1], ["LIMIT", 1]]
SELECT "worlds".* FROM "worlds" WHERE "worlds"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
---
  def landing
    store
    @user ||= User.find_by id: params[:user_id]
    @world ||= World.find_by id: params[:world_id]
    @character ||= Character.find_by world_id: @world.id

SELECT COUNT(*) FROM "squares" WHERE "squares"."world_id" = ?  [["world_id", 1]]
SELECT "characters".* FROM "characters" WHERE "characters"."world_id" = ? AND "characters"."user_id" = ? LIMIT ?  [["world_id", 1], ["user_id", 1], ["LIMIT", 1]]
---
    end

    @squares = Square.where(world_id: @world.id).order(:y, :x)
    Rails.logger.info "Total squares loaded for world: #{@squares.count}"

    @character = @world.characters.find_by(user_id: current_user.id)