app/controllers/users_controller.rb

INSERT INTO "users" ("email", "name", "password_digest", "created_at", "updated_at", "session_token") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    Rails.logger.debug "Parameters received: #{params.inspect}"

    @user = User.new(user_params)
    if @user.save