app/controllers/worlds_controller.rb

  def landing
    store
    @user_world ||= UserWorld.find_by(user_id: @user.id)
    @world ||= @user_world.world
    @character ||= @world.characters.first
---
SELECT "user_worlds".* FROM "user_worlds" WHERE "user_worlds"."user_id" = ? LIMIT ?  [["user_id", 4], ["LIMIT", 1]]
SELECT "user_worlds".* FROM "user_worlds" WHERE "user_worlds"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT "characters".* FROM "characters" WHERE "characters"."world_id" = ? ORDER BY "characters"."id" ASC LIMIT ?  [["world_id", 79], ["LIMIT", 1]]

  def create
    puts 'Form submitted successfully!'
    @world = World.new(last_played: DateTime.now, progress: 0)
    return unless @world.save

    @world.update(world_name: "World #{@world.id}")
    UserWorld.create!(user: @current_user, world: @world, user_role: user_roles, owner: true)
    Character.create!(world: @world, image_code: @image_path, shards: 10, x_coord: 10, y_coord: 10)
---
INSERT INTO "user_worlds" ("user_world_id", "user_role", "owner", "user_id", "world_id") VALUES (?, ?, ?, ?, ?)  [["user_world_id", "9e25440343453d174ac0"], ["user_role", "1_2_1"], ["owner", 1], ["user_id", 1], ["world_id", 1]]
INSERT INTO "worlds" ("world_id", "last_played", "progress") VALUES (?, ?, ?)  [["world_id", "8cec95a94224f1802773"], ["last_played", "2024-11-30 04:00:12.590310"], ["progress", 0]]
INSERT INTO "users" ("email", "name", "password_digest", "created_at", "updated_at", "session_token") VALUES (?, ?, ?, ?, ?, ?)
INSERT INTO "user_worlds" ("user_world_id", "user_role", "owner", "user_id", "world_id") VALUES (?, ?, ?, ?, ?)  [["user_world_id", "31d2ce2bc05518b82a42"], ["user_role", "1_2_2.png"], ["owner", 1], ["user_id", 4], ["world_id", 79]]
INSERT INTO "user_worlds" ("user_world_id", "user_role", "owner", "user_id", "world_id") VALUES (?, ?, ?, ?, ?)  [["user_world_id", "03bbf187a886dfc81605"], ["user_role", "1_1_1.png"], ["owner", 1], ["user_id", 4], ["world_id", 80]]
INSERT INTO "characters" ("character_id", "image_code", "shards", "x_coord", "y_coord", "world_id") VALUES (?, ?, ?, ?, ?, ?)  [["character_id", "de9cf3f88f3b8f71dd87"], ["image_code", "1_2_2.png"], ["shards", 10], ["x_coord", 10], ["y_coord", 10], ["world_id", 79]]
INSERT INTO "worlds" ("world_id", "last_played", "progress") VALUES (?, ?, ?)  [["world_id", "78c74c2845163e5fc405"], ["last_played", "2024-11-30 03:40:40.734382"], ["progress", 0]]

  def destroy
    @user_world = UserWorld.find_by(id: params[:id])
    @world = World.find_by(id: @user_world.world_id)
    if @user_world.owner
      UserWorld.where(world_id: @world.id).destroy_all
      @world.destroy
      flash[:notice] = "World '#{@world.world_id}' deleted."
    else
      @user_world.destroy
---
SELECT "worlds".* FROM "worlds" WHERE "worlds"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
SELECT "user_worlds".* FROM "user_worlds" WHERE "user_worlds"."id" = ? LIMIT ?  [["id", 72], ["LIMIT", 1]]
SELECT "user_worlds".* FROM "user_worlds" WHERE "user_worlds"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "worlds".* FROM "worlds" WHERE "worlds"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "user_worlds" WHERE "user_worlds"."id" = ?  [["id", 1]]
DELETE FROM "worlds" WHERE "worlds"."id" = ?  [["id", 1]]
SELECT "user_worlds".* FROM "user_worlds" WHERE "user_worlds"."world_id" = ?  [["world_id", 1]]
DELETE FROM "user_worlds" WHERE "user_worlds"."id" = ?  [["id", 21]]
DELETE FROM "worlds" WHERE "worlds"."id" = ?  [["id", 5]]

  def current_user
    @current_user ||= User.find_by id: params[:user_id]
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT ?  [["LIMIT", 1]]