app/controllers/worlds_controller.rb

SELECT "user_worlds".* FROM "user_worlds" WHERE "user_worlds"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT "worlds".* FROM "worlds" INNER JOIN "user_worlds" ON "worlds"."id" = "user_worlds"."world_id" WHERE "user_worlds"."user_id" = ?  [["user_id", 1]]
SELECT "user_worlds"."world_id" FROM "user_worlds" WHERE "user_worlds"."user_id" = ?  [["user_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."email" IS NULL LIMIT ?  [["LIMIT", 1]]
SELECT "worlds".* FROM "worlds" WHERE "worlds"."id" = ? LIMIT ?  [["id", 29], ["LIMIT", 1]]
---
  def index
    if @current_user
      @user_worlds = @current_user.user_worlds
      @invitations = Invitation.where(receiver_id: @current_user.id, status: 'pending')

      @invited_players = {}
      @user_worlds.each do |user_world|
        world = user_world.world
        # Get all invitations for this world, excluding accepted ones and getting unique emails
        @invited_players[world.id] = Invitation.where(world_id: world.id)
                                           .where.not(status: 'accepted')
                                           .includes(:receiver)
                                           .map { |invitation| invitation.receiver.email }
                                           .uniq
      end

      @world = @user_worlds.first&.world

SELECT "worlds".* FROM "worlds" WHERE "worlds"."id" = ? LIMIT ?  [["id", 29], ["LIMIT", 1]]
---
  def create
    puts "Form submitted successfully!"
    if params[:user_world_id].present?
      # Handle invited user character creation
      @user_world = UserWorld.find(params[:user_world_id])

SELECT "worlds".* FROM "worlds" WHERE "worlds"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "squares".* FROM "squares" WHERE "squares"."world_id" = ? ORDER BY "squares"."y" ASC, "squares"."x" ASC  [["world_id", 1]]
SELECT COUNT(*) FROM "squares" WHERE "squares"."world_id" = ?  [["world_id", 1]]
---
  def start_game
    @world = World.find(params[:id])
    @squares = @world.squares.order(:y, :x)

    store
    @user = current_user
    @user_world = UserWorld.find_by(user_id: @user.id, world_id: @world.id)
    # Find the specific character for this user in this world
    @character = @world.characters.find_by(user_id: @user.id)

    if @squares.count != 36