app/controllers/worlds_controller.rb

SELECT 1 AS one FROM "squares" WHERE "squares"."world_id" = ? LIMIT ?  [["world_id", 6], ["LIMIT", 1]]
---
  def generate_squares_for_world(world)
    puts 'generate_squares_for_world exists'
    return if world.squares.exists? # Prevent duplicate square generation