app/models/world.rb

    def generate_squares
      art_types = ["sand_dune", "forest", "mountain"] # Define your themes
      (1..36).each do |i|
        squares.create(
          x: (i % 6) + 1,
          y: (i / 6) + 1,
          state: "inactive",
          pixel_art: generate_pixel_art(art_types.sample) # Assign a random art type
        )
---
INSERT INTO "squares" ("square_id", "world_id", "x", "y", "state", "pixel_art") VALUES (?, ?, ?, ?, ?, ?)  [["square_id", "d89f22753604c9781677"], ["world_id", 1], ["x", 2], ["y", 1], ["state", "inactive"], ["pixel_art", "ERROR: Art not generated"]]